#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-VPKqpG5LgUDYZVud

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_instance.composer_external: Refreshing state... [id=i-02c95deccd991cab2]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-05822ed44fa303a69]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1845411010]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-4022049481]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-024c288a-d69c-4319-b8e0-f219119fb730]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-0308e169-2328-432a-a727-fdc0f46bf5f0]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_policy.external_composer_read_keys will be updated in-place
  ~ resource "aws_iam_policy" "external_composer_read_keys" {
        id     = "arn:aws:iam::933752197999:policy/external_composer_read_keys_staging"
        name   = "external_composer_read_keys_staging"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:external_composer_keys-g5E0gT" -> [
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9",
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:external_composer_keys-g5E0gT",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.external_worker_read_keys will be updated in-place
  ~ resource "aws_iam_policy" "external_worker_read_keys" {
        id     = "arn:aws:iam::933752197999:policy/external_worker_read_keys_staging"
        name   = "external_worker_read_keys_staging"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo" -> [
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9",
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.internal_composer_read_keys will be updated in-place
  ~ resource "aws_iam_policy" "internal_composer_read_keys" {
        id     = "arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging"
        name   = "internal_composer_read_keys_staging"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:internal_composer_keys-sovr4k" -> [
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9",
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:internal_composer_keys-sovr4k",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.internal_worker_read_keys will be updated in-place
  ~ resource "aws_iam_policy" "internal_worker_read_keys" {
        id     = "arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging"
        name   = "internal_worker_read_keys_staging"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel" -> [
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9",
                          + "arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-0c711269538c35f62" -> "ami-0a8ee9c8284b8f3ff" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-02c95deccd991cab2" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ iam_instance_profile         = "internal_composer_staging" -> "external_composer_staging"
      ~ id                           = "i-02c95deccd991cab2" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-18-204-220-203.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "18.204.220.203" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      - user_data                    = "e8116a8e7bc11fe5e64feddf4a729d1a0677da67" -> null # forces replacement
      + user_data_base64             = "H4sIAAAAAAAA/9R6+Y+cSp7n7yX1/8C4nzS7elNVHJlpp7s9miSBvIqIIiCChNmRxVUJQXAYyAO63/++CrLsrrL96s3srrQaS8giIr7353tEJcuq7JKyu3X6OvkoFEfWZXXQdPdFdknivwhhdSzjoOk/vTM3pq5CDLQF8t7d8LdbkjRtVpUfBelO/NPNn25ub18e+tPNV95a1tZVm3Xj2aDrgigtkrL7i/CUsaQMiuTTu6zMurvo6fDuH1ROE5TtU9Lc6mVUxVl5+Ci8D7PuxYFR5S65dPcRq47xbVSVT9nhTzdmViQ/KPfnl2dubo5t0rQfbwThVuAafBSSSL7lizeCIAhtm34Ojl1aNdmQxJ/zpB/P8n+3wru2TW+bNhAWi8VCVcAQLKU+knX+qi2shbpYLJYLa3mhT8Zmw1ZPy3KeRWzdF26jq42DZfYw63J75UhJ/T5ePg5niXozt0wt9rg36+SxycAF7NnqQ+TC+T0yajUWh7lxBv2v+dMhnT8de+BN5ptfzWAGe4eoh2kKKuPyhParabbuonvbYmWoG9mutvMJy+pqYvmd2hWHxZdDbi9m2pD2h3B2nJrz7OJsLhNXpUfbFFd7awC0Tp76zD3+2m7Qr6mMGyvfLdTjceNZYUPZr0ZKiuDh1Jx6B8rHFnan0lNpGj6ee/hedh9pUO/i+3nqBF8edels9DNsyOU+mjwezuIhs8JZm4WGM7wHTnJxlak1//CltqBreruoPvgNs4P1eufbZtoN8L0Z+w18MPC+sqVFsugnh7SLQANVh4VT+/T4XhkG8YuKDDlawgkUz/X0fP7ymJ7OctmFSu08PHZx0m1/JVPReizrct/bdunX8mCco0SWwv1l9r5M56xMHxr/QJP3UWWVjwvjch8xZabb2/6QHR8j9fxrLn3wjswz9/hLoHb5efuQI6rV1NnLydTcSrNKe99u19Hk3p3m/dPDKTZbksZfpOV+vSIE1kN1CMX5lHiZiPZGXfroXkrIYXmPfnVJ33lP3gexeSIwiheVvPKfyu108BDeb7dz08+D8nJR9PcYZrm+BfMWU1kUh9my78XN0+aLE24ldfr0/ilWggg1DxMt8nBsbO4ltQfuzJDo+8jPFiu43YFw2Buio3RPHy5iIlmfPglFQKvm35okToPuLqqKd6/xnsTydCrNR8wvr5hnvraRgKNP+drmUZWowSb1zHDU7LJ2ZmeYz/YfSnrvv0+qR2Dp96Z43k0+THdCFR7jIHsl7ObcZF3ymVeE57Ssgy79KNx3RX1N78+8Rnw+BU07ahZdq8BH4e/PikJbxZsH7fMSmubG+fRBiYKnD6KYTOWpPAkn0uTp/dM0fJoGiRgr0VySow9zaS4/Uy+h+QhtHX0ln4dyPJ1Np5Pp+6msKB/eT6RQSeQgCZ4+vFdm7xNZCT7I8eR74YvPSx05nx5ssXuwpSXC8dbJVA2RLbaxv7VEA6NxT+yWubS1MdKJDjTL9fe+aCg23qq+yAjWgGXK3gCIusL5VAplX0wKc+pouYxWKQ5lpMYiQi6uH0Kp3gZrnzq5gRA+7yxmqLHof0GEACtna8sxCMKGEouXzBSntW/EbSTVGtj7NHSBYq9S6uTSF2sfPxKdzByC/ARLOnHAPlgB6OxrNT7XfG/yai839g7ZolgkpYuRi4mhI90Q48LsbWqkREkbZyVOE1LPLBGoWGQKMgzfzruTm7MqLgBcjjpvlxgbui/HBtYNfTzrzjX+buUGsEq1cYnh2QSY3pA+uG4NMGFlUqoIYqCa0vbBLOIN0tSLtzeGmB52HtlSkpsyYObUz9MLwvgS4Atx9Q+KqW1RQskQyHVlKvXFWbM1pqmCmXd6kMHWdDeXiKokIbXjiZfAlCKFkLq3zpUINFR4SjU4ezYJDTAjEvGxpJZWzh6CVazCtdFFrLZNd154LuqTNbGdZTeEua/bbjcxlajxBmPnE3I0C9CaRlwvGRFdbbtGkq8hFgNHNk5+jhrXIBoqyYO9jnfYjVfOGg22DgLXBUXMYtc26gDkk0ksxmeTGYHrbKbekErhXv1iksUO637r6ubEXxmBo0upa7AMOSqw98g1dbCxS1VBIjt7JTuGhOFw2Q2oJHKooRNZSX2yrk7JPp1FOpJJLj1GubENrXoSyq0SMdKRNcnRihhY2i4dOVZN3EkelmyyJqm9V1E4bPNQ8S+7YXFBhTdYeNITDNRYJKrlGpDo0grt4w0mTF8y3zb1+dJizEB5pfiO75lKfvZX8zay5zuP+bWXszqW0RFLiwbk0hLqsWoSktv7GLlYWnrYWNk0ZoAdhsRR81A+736HVv1Ki/axYWVzBWMfWFhaWq43+XleXb5h1DrUKiprGciM2WI0DY36Ico3veNKQaAbF1tnZuJeUkdhbuREChrY0iFbjEpwdkssmuuNgiSkeCKq4uIgIQxOtmFky+LSxI7qATz3fBHJ7hoso9V8Za+3sql3j7Z7cYBEdubeO4NVe7IZK9111ISrGpO1eYL7+hzS1CbFpYvW+IRE6dFx8A672zVedjCgJIgGUiDR3wf6RHGcjYTdjkBtuwvXKbNzo8X7dGPJFw2vyATnAHiOMQX7hUJW0xJq6oPNYjEhqgWtWsRyDKxyoQBCbN/9IAKMJ1ive7tcDMGanYCxnUCyRUju+sQFtr2PCytP5UBJgV34x0g2Fdeey8BlEqJpl+jSbEmB6OXVdCfWU4QNyV5XFy+PpQgDb6cYO0wQjpdzFA5eH+fx3sP5FEv+g8fMiUdS0xq2EJQGDdztJaJ44lOk27m1s0vQOvYHJVqDaUSNE9gj0cu3R8Byydqb82V2rckIT/WNDgzM0BblTLMIMq61XNz90Cl4obdk0scrVgQuSOMVni2zxWGzVHVvj1J4qA6b5eL6GD6LSlCH8mS20czDTlMnZpbvvu0vVcffb2vPPR+cknReQfpX9NdHNrVqAp1q4g3V2RxqBpy6AEOdg6ESoVbn3lBdzKGSfK0aPKc6e7SagvG9zn2nTn2nugBaXaBTZ+CVfqD25Wkar0nv26oaruJTVDAxWImzzRpUnrORAIvreJXaWDSMsAB9slfFwJ0frzZfH3sPhtglPcxUzaHSKZK3UuBe8odi3vvnV/5IwxXLgz2avqQfH316ipfq0nf9U1Tg2Uav0zBbXEz+aFUPnKqHy0VvapvLRo8BWXzvJxWGinWwXF/095sDzNSd504OprPgz8ykeGbSw8Gki8G01bVDrFdxiN3tF98FIsxUFrpGHepG7q+3LFLMeaiALHZZ669IH4lq77uo8vbW0ZPn3Us7sEKyoCA0XqpW7G7bwDUPtkymG50d/eLD7AebDVXyikvt9eqDv88PlnspQ2XL/d3BTO0j+fd9/kJ3G4v6Aa9JFq4YfcAdS5zqsNM2Z6AdDl7BxJ31A6bGx3HneexepGiodj/bf37OplYXgNa5r9WUxwI6dQoc3hirKdQqyaSVCGjFLxEMOjU1acVjNpj0Lb4qA5TzraZjfGkl+lpd+E6lmE41eEMle7TOgFMNHPO+w/lXkufU1Hfe1Hfqc71GPnXmOVXvDZXCc8WklczpTa26cL2fefHcOo96v82397VKBkOlmFpNOV+f+2CoM74GtLrwuF+4HbQuTK0SPVrJplNJb/NVC88Z9ZF9bcxT7osechm0Grh+/ugfrl+dcT09Z8xz0dfe1JfzEk2nLsyBN9e6MGmdcz35GtCq3qO8NvAaUU09p2Y8zrye/EHcUm/gPKoBOlznuvCGsTbJQBv9yzxaTcxhtEPxnGtMfTr6+S19xbE+DRxPNTOH6uLz+Fwxd+Z6+7SS4NWvvemMNUHyneoM3savwrHpDaNdZ6hx3nXh0RFnl2ceU9Phsa1TjhuOM5/j+U2+KjO1Sn7OhYmv1SnQagaGauJffTP1Kcdfzbxh5CWbHM+U2/W2H641vGZcb+5HHm//ml9cvwl4rvNAqyRAqwm3AdDR/2/xHTFjjr6oLtwfPq1Tc5QzxlDktnscM3ydn3WqM8+lP+A7+ov7E2ocn6N9innNwTOPD9SqCceyOe6NeBiAVqfe23ETfYfnaNWblOfCiI0J1Pj7KGv0NeS45jHlfuF5R6vLH8StgCNOee2qM2/guK8GXoM4jkfcjdi45viYMxxvPC/ezuMMXPO+H3XRrvEDtDqbTp2aY22rc56LHh179pnnh6n9UX1YDFAba+SE54HH65V2nQGgxuM44vg84s2pJHjt/7xGpf6bebzg9S8D55/3BrRPz6E8ZWFpzTaaJwHHVDbLwznR9LOpLS6veopxkEyNyWavsmSNWDjOPNPhx1lG9YCzmMbUPFiFMfD+aMnzY6Sg3nPZMV6bs80K9MEe1Z5stL/T7zTLqVcWvjjoh772D/4vevHYW22X64Vqv2AsotXh57wXMtBqFY31uF4hp9aRUy9Np9Y55pBWG7xv8HXLqZfw2puWHD+A6+RUMqK1gWitmk6tobfs3xMxWM25rdON3rHEVrf+ihyvcyWfpRY/j92qY4nLckiZAXNkwBxPIY11mHs9zK0LzJEK6UaCubEc1yhZQoplSDcyzM0JpOkS0oUCqadAak1g7q9gvlV/x9d6sN9Cz5UYzOZvz3YvnkgmfeAaLaRgBWk0wJzLileQxgakaAWpLkGqD5D6Bsz1C8z95XhuPGv1MPd1mOMJpFxfPFzPWOflG/4c5yyDDJ4bM5ipdJxjXZCGP8yJz/hesTLYozRcqk7gxkdvj6SowO1zLPjcVUerlEWFxHPgh1i4Gj7DvTdsdDKJV+Tor0j+TEsi2Sh95/cwpmLHMA9EJtnGACwqfRZlqhrvUeW7U/F6p2Cn8A1bX2BbDdeIRcWU08i+rT7H6newoyOIh5qGsnQOFcCibPo6nv35gPSpA0sgcj8+FOAU7tUTj+dDMR+8ktThyjqGyrZ8WKq6w8yZt4+Ht849341e+vj7OXcIVnoPHH8f7FGFGVCRO6VRyc4/+kFN4Zhr1dTkdyE69jE6zjbXGY73CN4HL1/nSF53+bzA+/Q49zjjTPnKP55szuBqM/OpPgPDYgZkPPOdxcx39Zlf4BlYbWamk89Mms98TZ95Dp75mjfzCn1maoeZv8Iz6Fiv5/sVYZAeOH57WGxTWPgUUrWA9DCFdMHzMoc0P1/PkAIW2xxSbwILksIC95Dy89F390GV96Ap7x3jXY/Ph7xvcZs0PiuNs8zYv/mcCK6zw9Tn/UKrep/Po3Scb17ZD11z5lNrBhxz5g3WzHMOoy/Mwpv5Lp6ZA7cTzzwZzyB/d/QZ1PDM1KKZN0Tjmk8Xr+3XFiKkaQ4LU4SFUcDCEiHVZVhYE0g3A6RqDgsswsK7QLqZQBrJkB4GSHURUk8e6ah1+a6HTPns6WvjvZfPD8N4/3XGdz538p5Owdiz6/TavyuZ3409Wp19ftcY6gx+N8+YDp4B6s2gY84A98NoI7eLx92agWEz82Ru82YGnGgGNI6Vw8xzvJk3+o3b730Xf4PCwsgg9aZjDaP5FNJtAQt8hoV+htQTId1wWwdIDxIs9B5SfIEUFZAuJuN+oUvfxx9odWZe59TLOCvzd8p7/+gHxbz+LUA0n3OAz3jcXyMutHGu5HPNa/w70cwcFjOT2yfjmelaM5Nje8XvzNHMo97ML/TRDybPFc0a8Q4Gjpt8BgqOkc138T/IkMYUUiODBWKQRiKkBoOFOUBqniEFGSw8+doHoh7STQ8px8xGglSlkDI20r6OP7/H8Dym5jDOQ9KIB2fM+QkY6vz5PiqN91OeA9zuoc7G+X5c4zP7a/t5jvuFNwMra+Zr1gxo5mibyfOgwDOPbmZmwdf1Mfa8XvjaYsQHcDYz3/lZ/oMU0mh6xfTi/PWPTVZO1jaeHCyR2ERnKxsDleh43HuwamBjpidurVmi0dtyrMYiW1puvCWEbUMsqTvpMJiO+sUT8cXUfA24KDcVXSRinLn7WMeE7Wx5HthuKnviVMWYmMt8i6x9vApyQhy83SJRvxBM1FiJTY8CGLhoH65BYA1E9mSJxmJaeeIUBDlRHIKMBEvY2jNI9Fwk8vjDwQztox3fi8WXe7UaYsnB+3jrS9/p4XZLVKTuyx8KXJbuEmZs7OISIDmtfN2UggPHs6r4cmwEWFJNPdawYqyxyDJTRAjhrYoJUS0Hba0cKdY+Ln2RPFjufGvlBkLaZvBE4xwZxHEJaVxnI3siQ8tckjy6bSyphg/y1IArXSH7SglYnSbloncLkIUKyE29vsTitvL29SkQawUPxtETpVNMNoqvLZqI1BbUiRgYpAilfOexrR/iDkR99wXL22XsghNgyHbzzcQc4qlJ1I2ptzKQSRdjSzTXxizR53tzSL8gaXsBFIHQJTKw5zVxxYHsCfCteuaJhvEwGJWjM4cUZGlK+cRcxV+CrB0Q8b1I948RSQM/nzRWqZ5dZ9sAxxKBO1GiEkAzb3t71Z0cjXxx9oaVFMZ5WaR6KBI3lPy9m6OzJanLpPBPsbuZYCkVLXlOEJ62tlFnPr40vgt2gTjX7D2Y2GtPNNdbA7jGNlLwEGCwAxoWwzLaAYNlCfZOwdronHVdOhhMkX4YbL3bxgYrzdU2i0Xmk5UEfTEuHxQEwQBUt4wJWTHki8bFdkjhy4BiV2JEMsT4XPfmXh8sNwZWbqhIrkufpoov+0osInX88Ymq2CLG5kHcqvY+VpFu5FYRQ5KnCOhk5UsGcfNWdO25CMrDOaTgtGSpGDkEAFG/7GTxFBdzCtcxwYTphG3OQb41QiV2bGyQsLSUaOUXjrHpAxL3cHURiVgPAb4szQJtH4b4EujxBZN85+Ctn+i+bhGw9MWpa+UGcLDZw33th8w/e3mMYncz2MW0DAz95PXz/EH2G2j4hkn9ajcAmFBVNuX5I8rnlakj1TnXIy/b0CdWbhRQJ0sLS5pVGGosEuXZB62VG0osgtLF7CGW2NJiBrF1Q0H72P1qF863BljH2MaMLFnewz2iaGAzl6VbrpdTsJzIl8HNTSkuQOdjsA7zydklcR7ql84p/czVt7I3bN0EX7of7ZrsfDmtgpU1OHvim5SJnhhNE1Z79p789EfI738YtIhhOPoWWRjxnF5auCtNq25ikdGk9A27tHrsEkp0S7FlY2PuEU3weeLqmwbo834ngUmgLM4eSfexG3/x3csjyBmJys0EaaixpDSwROaBwTgtqS/ZJaCxHlNkoAHirif61AvE7pys2cXXiAZdlkfr6kyc1AmH1HlQCMAkfQyLdI3yzcR38cQiACZ6eyLYF3252qEVwYnebTyMVkjeGpjUM0jAQzxYfSDXfYiljChGbRf1Pu47HOOtG7ptjwuyAntAPAVcLMk7Oxo6R2zrwr0xjQ51SvJ54Cw7zZdqDRd15eHaJuu4ChQ1x0p9wQVCkbJQPBdMnNzYhFknklWnOmt28ZRYDSnKbTkSwxLJ0ZpZNgFkWZincE1AKFUTNOSSqaeDs48fHySGPZltEa5R4pK1OfhVPKCl1887LB56lNcuLoCL1mBPcj/1aXQiK2SjFZgEWbuL5PxiMWNImNGZ+NKGunQGbqxYjrh7/pHccHLrd3pg9en7H11s++HzTvfszwsEPgVN+TE4tx/bJGqSri2CMjgkzcdje5sEbXcrfZwryvupLM3fz+fz51Mfs7JLmjJgn6OqqKs2acbPe27b6tRM8mdxNlbtJdo8OhsIPpsLsFg9fxmwANr/mdT2GLZRk9VdVpW3zyS3UVUUQRnf5pbHqvlX2Z7t6ObnNbQdsDD1T20XHLLycJtcrnrfftX7Lji3d99eqjY8Ziy+q5rD9z7TNujTfdJF989nvnH4KlFfIt2xvxmqA+0RboDzGaOHT2nX1e3H+/vX1t59s/YuKIKhKp91uX/56cbPRP6wcNdVBfv5Fx3/nlc0+4/nl4Cx6pzEn+OqCLKyFT4J/y6865KgeGn5u38R3qXH8C5skvP36+eqyZPmxy3hq4QoED4J736udRTcRk13VyfFu5uv2l0Z/pf1+3+mx+9/cPdf+XTuctumCWNXcP7et3P/dB9m5X0YtOlNm3TCbXK8VEKd1clTkLGbtjo2UfLzT3Vu/izYSSd0aSK0fdslhZBWbVcGRXJ3c12IOia0SXf7dV345bsM+G9jKEoOWdslzWhtVrZdUEaJcM66VEBrcHdzf2ybe1ZFARulBOdWeJ1VwiHpbq9Lt6eAHRPhf/F8+rqUxcIvf3urNPGi+Jvwd4F+EW4b4d2dPdLZXZOVh3fCv14Vf1mJPj8L/vxcie5oW5U3X8nfOvnuP8lM+LswerMphNun/6wC/10CriU1q/ox3M+ZKiwXQpQ0XfaURUGX3N2EQZvMJsJtLNwKf/3rX4Vf/vbdp2K/Cf8q/PK3l7X6txdZ/p2Ur3Xgj2S8+kbhpxKeGf2RnDzp/y9wm5RxXWVld3tsGIfuG33mt59A/adN/w/x/aqtvwb0y613v3f6ithvDn3Dd9w53HcvsP0T4f9/wKyr9mfbgWix0j/dx8npvjwViVRKN7azcPTrSHAKmnuWhT+OBc9F+1gLbVc1wSERqvIbJu5usifhn4RDk9Q8pl/Z/Sbc100V3RfVsezav3AYlTeC8GdBL9tjkwi6agtZKzwdGet5qy+TqEti4Slr2u7uRhCeqkZwNqaOhKwU/ibe3Smi+NtfhLgau2L2JLRd0Am/vLDrmwz+L2yS4Dq9PWXXT7hZktSCdCMIcVUmN6MqyzSJcs5rb9jjx+fPLSlrhYA1SRD3QhHECVdntPHy1H7Oyqfq98QW+VN7d3lqX+3fjCqM8swg/1YZvnl3NCQR4qxJoq5qei6qyNo2Kw9ccJHHWSPcvvbtld0ijoWuus5VT20XhEJQxsLocE6ZRGklvPvlby90+e11hLiqcfIUHFnXCqIgvhP+LnRJItwGL5hyHTjL10aNCqCE10hbf8jK4+U6r126lstuEo6UJKpK4RadhK/QupJxLL3wdp00o71VOZJGaXXmVMLn7z318YeVnziFJE32xKtW8DxlPCM2a4Vzk3VByJIbQeiqY5S+or6/q5vqlHE1svLwOeLQ4IaMufyHB5+y/zZNahHTY9v9o6R3lcD4mFLypA6Esipv+aQSB00s1FXTXV2ZtQJL2lZgWZ6wnhOFyc2fhTYKyjKJR+DVTRUm8d3NnwUHavB/FGnQx0n5Pz8KbiKUCT8URZwFx0aTRbzdt1wmj1KZdHwOFlhySpgQdEJbFZz/2C7+RQiPnXBOeOb+cyekwSkRsk5oskPaCWV1vrv5liQjbK+4ip///6Gc3QZ1dtdWUZ50d/H9DQf8f52sOiVNk8XJXVSVT7zVjDX1yJjw178KOjRu/t0ej/7HzcPoXLtrkqD49Ppt/uH97IYf/sfkGwdJUZW3TcKqIObhemySOmh+LBv/zB1ZVF0iXC8QQps0pyxK2jEWVz3blzN1EbT5Ny5Xmn+T7p6pXpxLSp4jwu1tWZ2/nb+KeiZ79sIf0fzEcT8kye3tn27+dwAAAP//DgJH23M0AAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-094eb6457c09f6865" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0c711269538c35f62" -> "ami-0a8ee9c8284b8f3ff" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-05822ed44fa303a69" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-05822ed44fa303a69" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      - user_data                    = "6f4af0a9361d82cf25db5f619b1c66b6d06c2d93" -> null # forces replacement
      + user_data_base64             = "H4sIAAAAAAAA/9R6eY+cypbn/yW970D7XalndLuqWDKx0++51UkCuRURxRLB0tOy2CohCBYDucB797uPgiz7Vdm+dbtnRhq1JWQRy4lzfud3lqhkVVd9WvW3ztCkH7nySPu8Cdv+vswvafIXLqqPVRK2w6d3xtbQFIiAurT8dzfs7RanbZfX1UdOuOP/dPOnm9vbl4v+dPNVtpp3Td3l/bQ27Pswzsq06v/CPeU0rcIy/fQur/L+Ln46vPvHLqcNq+4pbW+1Kq6TvDp85N5Hef9iwaRyn176+5jWx+Q2rqun/PCnGyMv0x+U+/PLNTc3xy5tu483HHfLMQ0+cmks3rLBG47juK7LPofHPqvbfEyTz0U6TGvZv1vuXddlt20XcsvlcqlIYAxXwhCLGntVl+ZSWS6Xq6W5upAnfbul66dVtchjuhlKt9WU1kEifZD7wl47Qtq8T1aP41kgvuxWmUkfPaNJH9scXIBH1x9iFy7uLb1REn5c6Gcw/Fo8HbLF03EA/myx/dUIZTg4WDnMM1DrlyfLW8/zTR/f2yatIk3P941dzGje1DMz6JW+PCy/HAp7KatjNhwi+Tg3FvnF2V5mrkKOtsGvPXMEpEmfhtw9/tptrV8zEbVmsV8qx+PWN6OW0F/1DJfhw6k9DQ4Ujx3sT5WvkCx6PA/wveg+krDZJ/eLzAm/PGrCWR9kpIuVF88eD2f+kJuR3OWR7ozvgZNeXGluLj58aUzoGv4+bg5BS+1ws9kHtpH1I3xvJEELH3Tk1bawTJfD7JD1MWih4tBobp8e30vjyH9RLF2MV3AG+XMzP5+/PGans1j1kdQ4D499kva7X/GcNx+rpvIG266CRhz1c5yKQuRd5PdVtqBV9tAGB5K+j2uzelzql/uYSrJm74ZDfnyMlfOvhfDBP1Lf8NCXUOmL8+6hsIjaEMcT07mxE+Rafd/tNvHs3p0Xw9PDKTE6nCVfhJW3WWMMm7E+RPxijv2ctzy9qQLrXkjxYXVv/eriofef/A98+4RhnCxrcR08Vbv56FvI2+0WRlCE1eUiae8RzAttBxYdIiLPj/JqGPjt0/aLE+0EZf70/imRwthqH2Zq7KNE394LygBcWRfI+zjIl2u424No9HTekfqnDxc+FcxPn7gyJHX7b22aZGF/F9flu9d8TxNxPhcWE+dXV87TQN0KwNHmbGz7qAhEp7NG1h0lv2wc+QwL2ftQkfvgfVo/AlO7N/jzfvZhvufq6JiE+avDbs5t3qefWUZ4Dssm7LOP3H1fNtfw/sxyxOdT2HaTZvE1C3zk/v6sKLQVtH1QP6+gYWydTx+kOHz6wPPpXJyLs2gmzJ7eP82jp3mY8okULwQx/rAQFuLz7hU0HqGtWV+3LyIxmcvz+Wz+fi5K0of3MyGSUjFMw6cP7yX5fSpK4QcxmX1/+PLzSrOcTw823z/YwspCyc7JFdXCO2SjYGfyOrKmOb5fFcLORpaGNaCabuAFvC7ZaKcEPMVIBaYh+iPAyhoVcyESAz4tjbmjFqK1zlAkWkrCW5aLmodIaHbhJiBOoVsWOu9NqisJH3yxMAZmQTemo2ML6VLCX3KDnzeBnnSx0KjAC0jkAsleZ8QphC+mlzxiDcsOtoIUCRp2gBeuAXS8RknODZubvZordM/BOyvhceUiy0VY1yxN55PSGGyiZ1jKWmfNz1PcyCYPFMRTydL1wC76k1vQOikBXE0671YI6VogJjrSdG1a6y5U9m4WOjArpXWx7tsYGP6YPbhuAxCmVVopFkRAMYTdg1EmW0tVLr6njwk57H28I7gwRECNeVBkFwuhS4gu2NU+SIa6s1KCx1BsakNqLs6GbhDJJET904MIdoa7vcREwSluHJ+/hIYQSxg3g3mueaBapS/Vo+PRWaQDGQs4QIJSmQV9CNeJAjd6H9PGNtxF6bvWkG6w7az6MSoCzXb7mSHFrT/q+wDjo1GCztCTZkUx76q7jSUEqkUT4Ij6KSis1tWxalX4wd4ke+Qma2djjbYGQtcFZUIT19abEBSzWcInZ4Pqoets5/6YCZGnfDHwco+0oHM1Yxas9dDRhMzVaW45CrA9yzU0sLUrRbJ4evYreowwRdGqH60Ki5FqnfBaGNJNfUq9TI41S8SF8BgX+i4ym1kkdlJMcY83uLDWWEfCbuWIiWKgXvCRYOMNzmxPsaJxV0RScNmPy4tV+qOJZgNGQEl4rJiuDrEmrC0v2SJMtRUNbENbrExKdauopcAJfEMqzsF60cX2Yu/ToPEL2iSidUTCsgWFsIJaohgYF7aXWC4SVj7S1zZJKKCHMXWUIhLP+9/Zq3zda3mJbuYLCaEAmEhYma4/+3lcXb5x1Dw0ilU1IhAptfl4HunNQ1xsB8cVwlDTL7ZGjdS9ZI5E3diJJWukKwfvkFWBs1sh3thsJUuwJJ+36qQ8CBYCJ1vX81V5aRNH8QFa+AFvie4GrOL1Ym1vdqKh9Y+2e3GAgPeG55/BujvZlFbuJm6jdYPwxjhBrzlHJLNxeenjDTpZvPDoOGiP3N0GrXoYEhzGIy4tPvBCbSY5zlZAbo+huttHm4zahd4hL9ua4kVFazxDBQC+o8+Bt5Twel5BVXmwacKnWDGh2fBITIBZLSWAsR24H3iA0AxpzWBXyzHc0BPQdzOId5Yl9kPqAtv2ktIsMjGUMmCXwTEWDcm1FyJwqWCRrE81QV4RwPtFPd/zzdxCumBv6otfJEKMgL+X9D3CFkpWCysa/SEpEs9HxRwJwYNPjZmPM8McdxBUOgnd3SUmaBYQS7MLc29XoHPsD1K8AfOY6CfgWbxf7I6AFoLpGYtVfs3JFpprWw3oiFo7q6CqiS39msv5/Q+VgiV6U8RDsqZl6IIsWSN5lS8P25Wi+Z6VwUN92K6W10cPaFyBJhJn8lY1DntVmRl5sf82v1KcwNs1vns+OBXu/RIPr/ZfH9FQ6xl06pk/1mdjbChwmhKMTQHGmodqU/hjfTHGWgjUevSd+uyTeg6m96YInCYLnPoCSH2BTpODV/qBJhDnWbLBQ2ArSrROTnFJ+XDNy9sNqH1nKwCaNMk6sxGv61EJhtRT+NBdHK82Xx/bA2Pi4gHmiuoQ4RSLOyF0L8VDuRiC8ys8smhNi9Cz5i/3T482PyUrZRW4wSkukbzVmizKlxeDPWo9AKce4Go5GOr2stUSgJff46TASDIPphvwgbc9wFzZ++7sYDhL9sgGQbJBDgeDLEfDVjYONl/5IXF3XwIX8DBXaOTqTaTpRbDZ0VgyFpEE8sSlXbDGQ8wrQ+Bate+ZR19c9C/tQBLOwxKTZKWYibvrQtc42CKebzV6DMoP8g8264rgl5fGH5SHwCsOpnupImnH8O5hrgyx+PuYv9DdRrx2QBucR2tKHlBPU6c+7NXtGaiHg19Sfm/+wKnpcdxFkbgXIR7r/c/mn5+zoTYlIE0RqA1hvoBOkwGHFcZ6DtVaMEjNA1KzSwSFTkMMUjOfjQZ5S65CAWFy6/nkX1LzgdqUgVNLhlOP/liLPmly4NQj43zgMPm14DsNCZw39Z0HTK9JTpP7Tj34Yy2xWDFILbL9hlpfmN7PslhsnSe935Y7BGotgrGWDLUhTG7AMBibnI0BtSl9hguzgzSloda8T2rRcGrhbblK6TuTPmKgTnHKsBggO4PUI9MvmPBh+jU509N3pjjnA/VNfZks3nCa0hhZcW1KgzQF05ONAbUefMJyA8sR9dx3Gsr8zPLJH/gt80cmox6hw3RuSn+ccpMI1Alf6pN6ZoyTHZLvXH0akAnnt/Tlp/w0Mj411BjrS8D8c+XcmekdkFqAV1wHw5lyghA49Rm8zV+JcdMfJ7vOUGWym9InE88uzzLmhsN822SMN4xnAePzm3IVaqi1+BwLs0BtMqA2FIz1LLhiMw8I419D/XGSJRqMz4TZ9TYO1xzeUKY3w5H5O7jGF9NvBp7zPFBrAZB6xmwAZML/LbkTZ4wJi/rC8AhIkxnTOZMPeWa7zzjDxtlapz6zWPoDuRNeDE+oMn5O9knGNQbPzD9QrWeMy8Y0N/FhBGqT+W/7jQ8cFqP1YBAWCxM3ZlBl79NZE9aQ8Zr5lOHC4o7Ulz/wWwknnrLc1eT+yHhfjywHMR5PvJu4cY3xKWYY31hcvB3HObjG/TDpol79B0h9NpwmM6bc1hQsFn0y1ewziw9D/aP8sByhOuXIGYsDn+Ur9doDQJX5ceLxeeKbUwvwWv9ZjsqCN+N4yfJfDs4/rw2Wl50jcU6jypS3qi8Ax5C2q8M5VbWzoS4vr2qKfhAMlYrGoNB0Y9Fo6nnm44+9jOIDZzlPiHEwS31k9dEUF8dYsgbfpcdkY8jbNRhCz2p8Ue9+p96pptOsTXRxrB/q2j/kv6jFU221XaaX1QQlpTGpDz+XvRSB2ijWlI+bteU0muU0K8NpNMY5S210VjfYuOk0K3itTSvGH8B0cmrRIo1ukUYxnEa13rLfw3y4XjBb51utp6mt7II1Pl77StZLLX/uu3VPU5cWkFAdFpYOCzSHJNFg4Q+wMC+wsBRItgIs9NU0RvAKEiRCshVhYcwgyVaQLCVIfAkScwaLYA2LnfI7WGuht4O+K1CYL97u7V48sYiH0NU7SMAakniEBTsrWUOS6JBYa0g0ARJthCTQYaFdYBGspnXTWnOARaDBAs0gYfqi8brGPK/ewHPqs3Q8+m5CYa6QqY91QRb90Cc+83tNq9CzsmilOKGbHH3PEuISdc++YH1XE68zGpcCi4EffOGq6Aw9f9xqeJas8TFY4+J5L45FvQqc3+OYghzdOGAR51sd0LgKaJwrSuJZdeDO+eudgp6iN2x9wW0l2lg0LudsjxjYyrOvfoc7mgXR2JBIFM6RBGicz1/7czgfLG3uwArwDMeHEpwiTzkxfz6Ui9GvcBOtzWMk7aqHlaI51JB9LxnfWvd8N3qJ8fd97hiutQE4gRd6Vo0oUCx3TuKKnn/EQcngFGv13GB3ITLVMTL1NtcejtUIVgcvX/tIlndZv8Dq9NT3OFNP+QofXzRkuN7KAdFkMC5lICI5cJZy4GpyUCIZrLey4RSyQQo5UDXZd5AcqL7sl5psqAc5WCMZOubr/n6NKSQHxt8BlrsMlgGBRCkhOcwhWbK4LCApztc1uITlroDEn8ESZ7BEAyRsffzdfVBhNWjOasd012P9IatbzCaV9UpTLzPVb9YngmvvMA9YvVDrIWD9KJn6m1f2Q9eQA2LKwDFkfzRl3zlMWBilLwcuko2R2YlkX0QyZO+OJkMVyYYay/4YT2MBWb62X13ykGQFLA0elnoJS5OHRBNhac4g2Y6QKAUsEQ9L/wLJdgZJLEJyGCHReEh8cdpHzMt3NWTOes9Ane69rH8Yp/uvM72zvpPVdAKmmt1k1/pdi+xu7JP6HLC7xtjk8Lt+xnCQDIgvQ8eQAcNhspHZxfxuymDcyr7IbN7KwIlloDKuHGTf8WV/wo3Z73/nf53AUs8h8edTDiPFHJJdCUt0hqV2hsTnIdkyW0dIDgIstQESdIHEKiFZzqb5UhO+9z9Qm9y49qmXqVdm74TV/gkHybj+LYA3nmOA9XgMr4kX6tRXsr7mNf+dWDbGpWww+0QkG64pG4zba3ZnjmWf+HJQahMOBosV1Zz4DkbGm0IGJePI9jv/H0RIEgKJnsPSopDEPCQ6haUxQmKcIQE5LH3xWgfiAZLtAAnjzFaARCGQUDrtfe1/do9hcUyMceqHhIkPzhTzMzA2xfN9VJjupywGmN1jk0/9/TTGevbX9rMYD0pfBmtTDlRTBqox2WawOCiR7JOtbJRsXJt8z/JFoC4nfgBnKwfOz+IfZJDE8yunl+evf2wyC7yx0exg8tjGGl3bCChYQ9Pcg9kAG1EtdRvV5PXBFhMl4enKdJMdxnQXIUHZC4fRcJQvPo8uhhqowLUKQ9J4zCe56yUawnRvi4vQdjPR5+cKQthYFTvL9JJ1WGDsoN3O4rULRlhJpMTwCYCha3nRBoTmiEVfFEjCZ7XPz0FYYMnBlp4iAZkehVgreCxOPxzIlhfv2VzCv5xrlAgJDvKSXSB8p4fbr6wyc1/+UODSbJ9SfWuXl9ASszrQDCE8MD4rUiAmeogExdASFUn6BvE0N3jLstBOQRgrpmPtzMKSTC+pAh4/mO5iZxa6Zanb0ef1c6xjx8W4dZ2t6PPUWhWC4JNdawoNfBDnOlxrEvZqKaRNllbLwS1BHkmgMLTmkvC72veaU8g3Ehr1o88LpwRvpUBdtjFuTKhhPtRxGQnF3qe7IEI9iIf+CxJ3q8QFJ0At2y22M2NM5gZWtobWiUDEfYJM3tjocqotPGPMvljC7gKIBSIXi8BeNNjlR+xhEJiN7PO6/jDqtaNRB5d4ZQjFzFgnX8K8Gy0c+LEWHGOchUExa81KObvOrgWOyQN3JsUVgEbRDfa6Pzkq/uJ4upmW+nlVZlrEYzcSAs8trLMpKKu0DE6Ju50hIeNNcYEtNO9svckDdGkDF+xDfqHaHpjZG583NjsduPoultAYIrAHKuKjKt4DneYp8k/hRu+dTVM5CMwt7TDaWr9LdFoZ612e8DTAawEGfFI9SBYEI1DcKsF4Ta2A1y+2g8tABAS5AsWCzifnZjA8bTTdBJiFrlhiUwUkkwIxkBLeUqYfn4iCTKxvH/idYnuJYml6YZYJxEVmAQ2vA0HHbtHxrr3gQXU4RwScVjTjYwcDwGuXvcifknJB4CbBCFMN0+05LHZ6JCWOjXQcVaYUr4PS0bdDiJMBri885psxRJeVUVq7hzG5hFpyQbjYO2gXpFqgmRisAn7umoUOHGQM0GuCiAZnv0isxN2OdjmvQl07+cOieBCDFuqBbpCg3o8ApkQRDXHxaBWL2tAsxTk3kyxb12ZmoZdQwysTCapZ6krCY+kZg84sdCnhQeUi+pAIdGVSHduaLlle4n61CxU7HWwSZCOKV7QYoGcRa6SyS7Md08spaYHFy+gWhpCUoA8Q2ETF7OzipIi0S+9UQe5qO9Efd26KLv2Pds32gZjV4docHQ8HBqG8z8fzlDa+7eGf/gj5/Q+DJtZ1R9tZJrJYTK9M1FeG2bQJT0laBbpdmQNyMcGaKdmivjU8i6ToPHO1bQu0xbAXwCyUlmcfZ17iJl8C9/IICorjajuzVKs1hSw0eeqDUT+tSCDYFSCJlhBLt0aI+gFrcz/k+3O6oZdAxSp0aRFv6jN2MicaM+dBwgDh7DEqs41VbGeBi2YmBjDVuhNGAR+I9d5aY5Rq/dZH1toSdzrCjQwxeEhGcwjFZoiQkGNJb+yy8ZKhRwnauZHbDajEa+AB7EvgYgr+2VGtc0x3LvT0eXxoMlwsQmfVq4HQqKhsah81Nt4kdSgpBZKaCyotK5aWku+CmVPo2yjvebzuFWdDL76UKBGxCluM+aiyxHhDTRsDvCqNU7TBIBLqmTUWgqFlo+Mljw8CRb5IdxZqrNTFG2MM6mS0Vv6w6BF/GKyicVEJXGsDPFwEWUDiE15btrUGszDv9rFYXEyqjynVewNdukgTzsBNJNPh988/kutOYf5ODaw/ff+ji20/fN5rvv15aYFPYVt9DM/dxy6N27TvyrAKD2n78djdpmHX3wofF5L0fi4Ki/eLxeJ51ce86tO2CunnuC6bukvb6fOe264+tbPi+TgbKfbK2j46Wwg+G0uwXD9/GbAE6v/Zqd0x6uI2b/q8rm6ft9zGdVmGVXJbmD6tF1/P9m1HMz5voO2ApaF96vrwkFeH2696337V+y48d3ffXuouOuY0uavbw/eYqVvr033ax/fPa75J+HqitrI0x/5mqAbUR7gFzmdkPXzK+r7pPt7fn5o4veUTQRLmM4mX57NFJMTJ7WK8tO/H+enuNRp339C4YxvvwjIc6+pZ4fuX33f8TK8fBu76uqQ//+zj34ua5P/x/BJSWp/T5HNSl2Feddwn7t+5d30ali/hefcv3LvsGN1FbXr+fvxct0Xa/jjFfT0hDrlP3Lufax2Ht3Hb3zVp+e7mq3ZXgf9l/f6f6fH7X+X9V76vu9x2WUrplcG/94HdP91HeXUfhV1206U9d5seLzXX5E36FOb0pquPbZz+/Huemz9zdtpzfZZy3dD1aclldddXYZne3VwH4p5yXdrffh3nfvkuTP7bGGqlh7zr03ayNq+6PqzilDvnfcZZG3B3c3/s2ntaxyGdTgnPHfc6tLhD2t9eh25PIT2m3P9i8fR1KE+4X/72Vv5imfM37u8c+cLdtty7O3vaZ/dtXh3ecf96Vfxluvr8fPDn53R1R7q6uvm6/a2V7/6Twri/cxOabcndPv1nFfjv4nA1bWg9TO5+jlRuteTitO3zpzwO+/TuJgq7VJ5xtwl3y/31r3/lfvnbd9+T/cb9K/fL314m9N9eRPl3p3zNA390xqsPGX56wrOgPzqnSIf/C96mVdLUedXfHlvKqPtGMfrtJ1T/aWfwh/x+VftfE/rl1LvfW31l7DdA38COgcOwe8Htnxz+/4fMmmJ/th1oLdfap/skPd1XpzIVKuHGdpaOdu0bTmF7T/Pox97hOWkfG67r6zY8pFxdfePE3U3+xP0Td2jThvn0q7jfuPumreP7sj5WffcXRqPqhuP+zGlVd2xTTlNsLu+4pyOlAyv1VRr3acI95W3X391w3FPdcs7W0Cwur7i/8Xd3Es//9hcuqaeqmD9xXR/23C8v7Pp2BvsXtWl4bfGe8ut33jRNG0644bikrtKbSZVVlsYFk+Xp9vSF+nNJyjsupG0aJgNXhknK1JlsvDx1n/Pqqf69Y8viqbu7PHWv5m8mFabzjLD4lhm+oTsZknJJ3qZxX7cDO6rMuy6vDuzgskjylrt9je1V3DJJuL6+9lVPXR9GXFgl3AQ425nGWc29++VvL3T57bWHmKpJ+hQead9xPMe/4/7O9WnK3YYvhDIdmMjXRk0KWCnLkbb2kFfHy7Vfu/QdO7tNGVPSuK64W+vEfaXWdRvj0gu0m7Sd7K2raWuc1We2i/v8PVIffxj5CSg4bfMnlrXC5y7jmbF5x53bvA8jmt5wXF8f4+zV7vu7pq1POVMjrw6fY0YNZsgUy3+48Cn/b1Oklgk5dv0/Unpfc5S1KRUL6pCr6uqWdSpJ2CZcU7f9Fcq842jadRzNi5QObFOU3vyZ6+KwqtJkIl7T1lGa3N38mXOgCv9HmYVDklb/8yPnplyVskVxzEQwbrR5zMp9x85kXqrSnvXBHE1PKeXCnuvqksmfysW/cNGx584pi9x/7rksPKVc3nNtfsh6rqrPdzffgmSi7ZVXyfP/P6Sz27DJ77o6LtL+Lrm/YYT/r2+rT2nb5kl6F9fVEys1U049Usr99a+cBvWbf7enpf9x8zCBa/dtGpafXr8tPryXb9jif3S+SZiWdXXbprQOE+auxzZtwvbHtPHPDMiy7lPueoHgurQ95XHaTb646tm97KnLsCu+Sbnu+Tfh7nnXi3VpxWKEu72t6vO39dejnrc9o/BHe34C3A9Bcnv7p5v/HQAA///qZ0sOmDQAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0b3c795e3ec583ff8" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ image_id                = "ami-0c711269538c35f62" -> "ami-0a8ee9c8284b8f3ff"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ image_id                = "ami-0c711269538c35f62" -> "ami-0a8ee9c8284b8f3ff"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118123611734800000001" -> (known after apply)
      ~ id                                  = "sfr-0308e169-2328-432a-a727-fdc0f46bf5f0" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118123632317200000002" -> (known after apply)
      ~ id                                  = "sfr-024c288a-d69c-4319-b8e0-f219119fb730" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-4022049481" -> (known after apply)
      ~ instance_id = "i-02c95deccd991cab2" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1845411010" -> (known after apply)
      ~ instance_id = "i-05822ed44fa303a69" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20210115165248 (ami-0c711269538c35f62)" -> "RHEL 8 pre-built: imagebuilder-service-image-20210118143243 (ami-0a8ee9c8284b8f3ff)"
```

</details>

*Pusher: @major, Action: `pull_request`*